app/views/user_cards/new.html.erb

  <div class="col-md-6 col-md-offset-3">
    <%= form_for(:user_card, url: new_user_card_path(User.find(1))) do |f| %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]