app/views/cards/sent.html.erb

SELECT  "recipients".* FROM "recipients" WHERE "recipients"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
<%@cards.each do |card| %>
	<p><%= User.find(card.recipient.id).username%> received: <br>