app/controllers/cards_controller.rb

	def sent
		@user = User.first
		@cards = @user.user_cards
		render json: @cards.map { |card|
        {id: card.id,
        	recipient: User.find(card.recipient.id).username,
        greeting: card.card.greeting,
        message: card.card.message}
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."user_id" = $1  [["user_id", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "recipients".* FROM "recipients" WHERE "recipients"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

	def new
		@card_template = Template.find(params[:template_id])
---
SELECT  "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT 1  [["id", 1]]