app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "coline@gmail.com"]]
---
	def create
		if @user = User.find_by(email: params[:email])