app/controllers/user_cards_controller.rb

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = $1 LIMIT 1  [["id", 1]]
---
	def new
		@card_template = Template.find(params[:template_id])