app/controllers/users_controller.rb

	def sent
		@user = User.find(params[:id])
		@cards = @user.user_cards
		render json: @cards.map { |card|
        {id: card.id, to: User.find(card.user_id).phone, from: User.find(card.recipient_id).phone,
        	# recipient: User.find(card.recipient.id).username,
        greeting: card.card.greeting,
        message: card.card.message,
        occasion: card.card.occasion } }
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."user_id" = $1  [["user_id", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "recipients".* FROM "recipients" WHERE "recipients"."id" = $1 LIMIT 1  [["id", 2]]

	def received
		@user = User.find(params[:id])
		@cards = UserCard.where(recipient_id: @user.id)
		render json: @cards.map { |card|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "user_cards".* FROM "user_cards" WHERE "user_cards"."recipient_id" = $1  [["recipient_id", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 5]]